# Processamento de dados

## Lendo a tabela Excel

In [3]:
from pathlib import Path

import pandas as pd

caminho_dados = Path('dados') / 'dados.xlsx'
dados_brutos = pd.read_excel(caminho_dados)

In [2]:
dados_brutos

,Data/Hora,Vendedor,Cliente,Produto,Quantidade,Valor Unitário,Valor Venda
0,2023-01-01 02:39:07,Caroline Fernandes,Helena Alves,Mesa,4,649.99,2599.96
1,2023-01-01 02:52:49,Noah Aragão,Benjamin Moraes,Cadeira,1,249.99,249.99
2,2023-01-01 03:35:33,Caroline Fernandes,Yuri Lima,Televisão,4,994.90,3979.60
3,2023-01-01 04:24:04,Gustavo Porto,Sr. Heitor Viana,Televisão,1,994.90,994.90
4,2023-01-01 04:50:42,Noah Aragão,Maria Sophia Silveira,Mesa,2,649.99,1299.98
...,...,...,...,...,...,...,...
995,2023-03-30 08:07:15,Noah Aragão,Juan da Rosa,Cadeira,4,249.99,999.96
996,2023-03-30 10:19:41,Gustavo Porto,João Guilherme da Luz,Televisão,3,994.90,2984.70
997,2023-03-30 12:32:57,Noah Aragão,Maitê da Luz,Televisão,1,994.90,994.90
998,2023-03-30 14:07:39,Caroline Fernandes,Luiz Fernando Vieira,Cadeira,2,249.99,499.98
999,2023-03-30 20:46:40,Otávio Carvalho,Thiago Rezende,Televisão,2,994.90,1989.80

## Filtrando por um mês específico

In [3]:
dados_brutos['Data/Hora'].apply(lambda dt: (dt.year, dt.month)).unique()

array([(2023, 1), (2023, 2), (2023, 3)], dtype=object)

In [6]:
mes_referencia = '2023-01'
filtro = dados_brutos['Data/Hora'].apply(
    lambda dt: dt.strftime('%Y-%m') == mes_referencia
)

dados_filtrados = dados_brutos.loc[filtro]
dados_filtrados

,Data/Hora,Vendedor,Cliente,Produto,Quantidade,Valor Unitário,Valor Venda
0,2023-01-01 02:39:07,Caroline Fernandes,Helena Alves,Mesa,4,649.99,2599.96
1,2023-01-01 02:52:49,Noah Aragão,Benjamin Moraes,Cadeira,1,249.99,249.99
2,2023-01-01 03:35:33,Caroline Fernandes,Yuri Lima,Televisão,4,994.90,3979.60
3,2023-01-01 04:24:04,Gustavo Porto,Sr. Heitor Viana,Televisão,1,994.90,994.90
4,2023-01-01 04:50:42,Noah Aragão,Maria Sophia Silveira,Mesa,2,649.99,1299.98
...,...,...,...,...,...,...,...
337,2023-01-31 14:22:44,Eloah Fernandes,João Lucas Caldeira,Televisão,4,994.90,3979.60
338,2023-01-31 16:34:17,Noah Aragão,Dr. Thales Nascimento,Mesa,4,649.99,2599.96
339,2023-01-31 18:05:20,Eloah Fernandes,Enzo Gabriel Pereira,Cadeira,4,249.99,999.96
340,2023-01-31 21:11:51,Gustavo Porto,Sr. Renan Rezende,Cadeira,1,249.99,249.99
341,2023-01-31 23:19:28,Noah Aragão,Luiz Gustavo Ramos,Cadeira,1,249.99,249.99

In [12]:
dados_vendas = dados_filtrados.pivot_table(
    index='Vendedor',
    columns='Produto',
    values='Quantidade',
    aggfunc='sum',
    margins=True,
    margins_name='TOTAL'
).sort_values(by='TOTAL')
dados_vendas

Produto             Cadeira  Mesa  Televisão  TOTAL
Vendedor
Otávio Carvalho          58    52         75    185
Noah Aragão              43    79         78    200
Gustavo Porto            65    65         77    207
Caroline Fernandes       75    89         64    228
Eloah Fernandes          85    63         91    239
TOTAL                   326   348        385   1059

In [13]:
dados_volume = dados_filtrados.pivot_table(
    index='Vendedor',
    columns='Produto',
    values='Valor Venda',
    aggfunc='sum',
    margins=True,
    margins_name='TOTAL'
).sort_values(by='TOTAL')
dados_volume

Produto              Cadeira       Mesa  Televisão      TOTAL
Vendedor
Otávio Carvalho     14499.42   33799.48    74617.5  122916.40
Gustavo Porto       16249.35   42249.35    76607.3  135106.00
Noah Aragão         10749.57   51349.21    77602.2  139700.98
Caroline Fernandes  18749.25   57849.11    63673.6  140271.96
Eloah Fernandes     21249.15   40949.37    90535.9  152734.42
TOTAL               81496.74  226196.52   383036.5  690729.76

In [15]:
dados_filtrados.groupby('Vendedor')[['Valor Venda']].mean()

                    Valor Venda
Vendedor
Caroline Fernandes  2003.885143
Eloah Fernandes     2009.663421
Gustavo Porto       2251.766667
Noah Aragão         1995.728286
Otávio Carvalho     1862.369697

In [1]:
from processamento_de_dados import carregar_tabelas

In [4]:
tabelas = carregar_tabelas(
    mes_referencia='2023-01',
    pasta_dados=Path('dados'),
    arquivo_excel='dados.xlsx'
)

In [5]:
tabelas

{'tabela_vendas': Produto             Cadeira  Mesa  Televisão  TOTAL
 Vendedor
 Otávio Carvalho          58    52         75    185
 Noah Aragão              43    79         78    200
 Gustavo Porto            65    65         77    207
 Caroline Fernandes       75    89         64    228
 Eloah Fernandes          85    63         91    239
 TOTAL                   326   348        385   1059,
 'tabela_volume': Produto              Cadeira       Mesa  Televisão      TOTAL
 Vendedor
 Otávio Carvalho     14499.42   33799.48    74617.5  122916.40
 Gustavo Porto       16249.35   42249.35    76607.3  135106.00
 Noah Aragão         10749.57   51349.21    77602.2  139700.98
 Caroline Fernandes  18749.25   57849.11    63673.6  140271.96
 Eloah Fernandes     21249.15   40949.37    90535.9  152734.42
 TOTAL               81496.74  226196.52   383036.5  690729.76,
 'tabela_ticket_medio':                     Valor Venda
 Vendedor
 Caroline Fernandes  2003.885143
 Eloah Fernandes     2009.663421
 Gustavo Porto       2251.766667
 Noah Aragão         1995.728286
 Otávio Carvalho     1862.369697}

## Testando o Processamento de dados

In [1]:
from pathlib import Path

from processamento_de_dados import carregar_tabelas

mes_referencia = '2023-01'
pasta_dados = Path('dados')
arquivo_excel = 'dados.xlsx'

tabelas = carregar_tabelas(
    mes_referencia=mes_referencia,
    pasta_dados=pasta_dados,
    arquivo_excel=arquivo_excel
)

for nome, tabela in tabelas.items():
    print(f'---- {nome} ----')
    display(tabela)

---- tabela_vendas ----

Produto             Cadeira  Mesa  Televisão  TOTAL
Vendedor
Otávio Carvalho          58    52         75    185
Noah Aragão              43    79         78    200
Gustavo Porto            65    65         77    207
Caroline Fernandes       75    89         64    228
Eloah Fernandes          85    63         91    239
TOTAL                   326   348        385   1059

---- tabela_volume ----

Produto              Cadeira       Mesa  Televisão      TOTAL
Vendedor
Otávio Carvalho     14499.42   33799.48    74617.5  122916.40
Gustavo Porto       16249.35   42249.35    76607.3  135106.00
Noah Aragão         10749.57   51349.21    77602.2  139700.98
Caroline Fernandes  18749.25   57849.11    63673.6  140271.96
Eloah Fernandes     21249.15   40949.37    90535.9  152734.42
TOTAL               81496.74  226196.52   383036.5  690729.76

---- tabela_ticket_medio ----

                    Valor Venda
Vendedor
Caroline Fernandes  2003.885143
Eloah Fernandes     2009.663421
Gustavo Porto       2251.766667
Noah Aragão         1995.728286
Otávio Carvalho     1862.369697

In [2]:
tabela_vendas = tabelas['tabela_vendas']

In [3]:
tabela_vendas

Produto             Cadeira  Mesa  Televisão  TOTAL
Vendedor
Otávio Carvalho          58    52         75    185
Noah Aragão              43    79         78    200
Gustavo Porto            65    65         77    207
Caroline Fernandes       75    89         64    228
Eloah Fernandes          85    63         91    239
TOTAL                   326   348        385   1059

In [4]:
tabela_html = tabela_vendas.to_html()

In [5]:
print(tabela_html)

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th>Produto</th>
      <th>Cadeira</th>
      <th>Mesa</th>
      <th>Televisão</th>
      <th>TOTAL</th>
    </tr>
    <tr>
      <th>Vendedor</th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>Otávio Carvalho</th>
      <td>58</td>
      <td>52</td>
      <td>75</td>
      <td>185</td>
    </tr>
    <tr>
      <th>Noah Aragão</th>
      <td>43</td>
      <td>79</td>
      <td>78</td>
      <td>200</td>
    </tr>
    <tr>
      <th>Gustavo Porto</th>
      <td>65</td>
      <td>65</td>
      <td>77</td>
      <td>207</td>
    </tr>
    <tr>
      <th>Caroline Fernandes</th>
      <td>75</td>
      <td>89</td>
      <td>64</td>
      <td>228</td>
    </tr>
    <tr>
      <th>Eloah Fernandes</th>
      <td>85</td>
      <td>63</td>
      <td>91</td>
      <td>239</td>
    </tr>
    <tr>
      <th>TOTAL</th>
      <td>326</td>
      <td>348</td>
      <td>385</td>
      <td>1059</td>
    </tr>
  </tbody>
</table>

In [8]:
with open('tabela_vendas.html', 'w') as arquivo:
    for tabela in tabelas.values():
        arquivo.write(tabela.to_html())

In [9]:
import locale

lingua = 'pt_BR.UTF-8'
locale.setlocale(locale.LC_ALL, lingua)

'pt_BR.UTF-8'

In [11]:
valor = 10.5
locale.currency(valor)

'R$ 10,50'

In [15]:
def formatar_valor(valor):
    lingua = 'pt_BR.UTF-8'
    locale.setlocale(locale.LC_ALL, lingua)
    return locale.currency(valor, grouping=True)

In [16]:
with open('tabela_vendas.html', 'w') as arquivo:
    for tabela in tabelas.values():
        arquivo.write(tabela.to_html(float_format=formatar_valor))